InformationRegisters/Б24_КС_ТаблицаИзменений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>Б24_КС_ТаблицаИзменений</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВремяЗаписиВМиллисекундах</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>НастройкаПодключения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Б24_К_НастройкиПодключения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипДанных</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Б24_К_ТипыДанныхДляОбменаСПорталом</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.ВидыНоменклатуры</v8:Type>
						<v8:Type>cfg:CatalogRef.ЗначенияСвойствОбъектов</v8:Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
						<v8:Type>cfg:CatalogRef.Б24_КС_ПользовательскиеГруппыТоваров</v8:Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПодчиненныйОбъект</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/Б24_КС_ТаблицаИзменений/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ДобавитьОбъектВТаблицуИзменений(НастройкаПодключения, ТипДанныхДляРегистрацииИзменений, Объект, ПодчиненныйОбъект = Неопределено, ВремяЗаписиВМиллисекундах = Неопределено) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Объект) И НЕ ЗначениеЗаполнено(ПодчиненныйОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("НастройкаПодключения"	, НастройкаПодключения);
	СтруктураОтбора.Вставить("ТипДанных"			, ТипДанныхДляРегистрацииИзменений);
	СтруктураОтбора.Вставить("Объект"				, Объект);
	СтруктураОтбора.Вставить("ПодчиненныйОбъект"	, ПодчиненныйОбъект);
	
	Если РегистрыСведений.Б24_КС_ТаблицаИзменений.Получить(СтруктураОтбора).ВремяЗаписиВМиллисекундах = 0 Тогда  
		НоваяЗапись = РегистрыСведений.Б24_КС_ТаблицаИзменений.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(НоваяЗапись, СтруктураОтбора);
		НоваяЗапись.ВремяЗаписиВМиллисекундах = ?(ВремяЗаписиВМиллисекундах = Неопределено, ТекущаяУниверсальнаяДатаВМиллисекундах(), ВремяЗаписиВМиллисекундах);
		НоваяЗапись.Записать();
	КонецЕсли;
	
КонецПроцедуры

Функция НаличиеИзмененийНаДату(НастройкаПодключения, ВремяЗаписиВМиллисекундах) Экспорт
	
	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("НастройкаПодключения", НастройкаПодключения);
	Запрос.УстановитьПараметр("ВремяЗаписиВМиллисекундах", ВремяЗаписиВМиллисекундах);
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	Б24_КС_ТаблицаИзменений.Объект КАК Объект
	|ИЗ
	|	РегистрСведений.Б24_КС_ТаблицаИзменений КАК Б24_КС_ТаблицаИзменений
	|ГДЕ
	|	Б24_КС_ТаблицаИзменений.НастройкаПодключения = &НастройкаПодключения
	|	И Б24_КС_ТаблицаИзменений.ВремяЗаписиВМиллисекундах > &ВремяЗаписиВМиллисекундах
	|
	|СГРУППИРОВАТЬ ПО
	|	Б24_КС_ТаблицаИзменений.Объект";
	
	ВыполненныйЗапрос = Запрос.Выполнить();
	
	Возврат НЕ ВыполненныйЗапрос.Пустой(); 

КонецФункции

#КонецЕсли
